app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:nome).page params[:page]
---
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."nome" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "contacts"

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("nome", "cellphone", "created_at", "updated_at", "email", "address", "birthdate") VALUES (?, ?, ?, ?, ?, ?, ?)