app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @users = User.order(:name).page(params[:page]).per(10)